#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-jp8N2Sd6KFgcyfRr

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.signup: Reading...
data.archive_file.signup: Read complete after 0s [id=d583e63bc954d31efa1879a70c828de8fe0682a7]
aws_iam_role.signup_event_role: Refreshing state... [id=signup_event_role]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=habru0]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]
aws_lambda_function.signup_post_confirmation: Refreshing state... [id=signup_post_confirmation]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_KFBySRRrW]
aws_cognito_user_pool_domain.shuuren_auth_domain: Refreshing state... [id=auth.shuuren.com]
aws_lambda_permission.allow_cognito_post_confirmation: Refreshing state... [id=AllowExecutionFromCognito]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=5t6dfe58g76h8vkmcfvb2o6keu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.signup_event_logging will be created
  + resource "aws_iam_policy" "signup_event_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "signup_event_logging"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.signup_event_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "signup_event_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "signup_event_role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*